In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [8]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(data = my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [13]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(data = [sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [30]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','France','UK'])

In [16]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [26]:
ser1['USA']

1

In [33]:
ser11 = pd.Series([1,2,3,],['USA','Italy','Germany'])

In [28]:
ser11

USA        1
Italy      2
Germany    3
Japan      4
dtype: int64

In [34]:
ser1 + ser11

France     NaN
Germany    5.0
Italy      NaN
UK         NaN
USA        2.0
dtype: float64

In [35]:
from numpy.random import randn

In [36]:
np.random.seed(101)

In [66]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [40]:
df

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [41]:
df.Z

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [42]:
df[['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967

In [64]:
df['new'] = df['X'] + df['Y']

In [56]:
df['new']

A   -0.012363
B    0.557432
C    0.711747
D   -1.697476
E    2.139882
Name: new, dtype: float64

In [57]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.012363
B -0.134841  0.390528  0.166905  0.184502  0.557432
C  0.807706  0.072960  0.638787  0.329646  0.711747
D -0.497104 -0.754070 -0.943406  0.484752 -1.697476
E -0.116773  1.901755  0.238127  1.996652  2.139882

In [62]:
df.drop('new',axis = 1,inplace=True)

In [65]:
df.drop('E')

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.012363
B -0.134841  0.390528  0.166905  0.184502  0.557432
C  0.807706  0.072960  0.638787  0.329646  0.711747
D -0.497104 -0.754070 -0.943406  0.484752 -1.697476

In [67]:
df.shape

(5, 4)

In [68]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [70]:
df.loc['E']

W   -0.925874
X    1.862864
Y   -1.133817
Z    0.610478
Name: E, dtype: float64

In [71]:
df.iloc[2]

W    2.154846
X   -0.610259
Y   -0.755325
Z   -0.346419
Name: C, dtype: float64

In [72]:
df.loc['E','Z']

0.6104779075384634

In [73]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  0.196800 -1.136645
B -0.156598 -0.031579

In [77]:
booldf = df > 0
booldf

       W      X      Y      Z
A  False   True  False   True
B   True  False  False   True
C   True  False  False  False
D   True  False   True   True
E  False   True  False   True

In [78]:
df[booldf]

          W         X         Y         Z
A       NaN  0.196800       NaN  0.000366
B  1.025984       NaN       NaN  0.649826
C  2.154846       NaN       NaN       NaN
D  0.147027       NaN  0.558769  1.024810
E       NaN  1.862864       NaN  0.610478

In [79]:
df[df > 0]

          W         X         Y         Z
A       NaN  0.196800       NaN  0.000366
B  1.025984       NaN       NaN  0.649826
C  2.154846       NaN       NaN       NaN
D  0.147027       NaN  0.558769  1.024810
E       NaN  1.862864       NaN  0.610478

In [87]:
df['Z'] > 1

A    False
B    False
C    False
D     True
E    False
Name: Z, dtype: bool

In [90]:
resultdf = df[df['Z']>0]

In [91]:
resultdf

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [92]:
resultdf['Z']

A    0.000366
B    0.649826
D    1.024810
E    0.610478
Name: Z, dtype: float64

In [99]:
df[df['Z']>0][['X','Y']]

          X         Y
A  0.196800 -1.136645
B -0.156598 -0.031579
D -0.479448  0.558769
E  1.862864 -1.133817

In [101]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [103]:
boolser = df['Z']>0
result = df[boolser]
mycols = ['Y','X']
result[mycols]

          Y         X
A -1.136645  0.196800
B -0.031579 -0.156598
D  0.558769 -0.479448
E -1.133817  1.862864

In [111]:
df[(df['Z']>0) & (df['Y']>0)]

          W         X         Y        Z
D  0.147027 -0.479448  0.558769  1.02481

In [113]:
df[(df['Z']>0) | (df['Y']>0)]

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [114]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.993263  0.196800 -1.136645  0.000366
1     B  1.025984 -0.156598 -0.031579  0.649826
2     C  2.154846 -0.610259 -0.755325 -0.346419
3     D  0.147027 -0.479448  0.558769  1.024810
4     E -0.925874  1.862864 -1.133817  0.610478

In [115]:
newind = 'CA NY WY OR CO'.split()

In [116]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [117]:
df['states'] = newind

In [118]:
df

          W         X         Y         Z states
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     WY
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CO

In [141]:
df.set_index('states')

KeyError: "None of ['states'] are in the columns"

In [123]:
df

          W         X         Y         Z states
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     WY
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CO

In [142]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [143]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [146]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [145]:
df

             A         B
G1 1 -1.382920  1.482495
   2  0.961458 -2.141212
   3  0.992573  1.192241
G2 1 -1.046780  1.292765
   2 -1.467514 -0.494095
   3 -0.162535  0.485809

In [128]:
df.loc['G1']

          A         B
1  0.386030  2.084019
2 -0.376519  0.230336
3  0.681209  1.035125

In [135]:
df.loc['G1'].loc[1]

A    0.386030
B    2.084019
Name: 1, dtype: float64

In [131]:
df.loc['G1']

          A         B
1  0.386030  2.084019
2 -0.376519  0.230336
3  0.681209  1.035125

In [140]:
df

             A         B
G1 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125
G2 1 -0.031160  1.939932
   2 -1.005187 -0.741790
   3  0.187125 -0.732845

In [149]:
df.index.names = ['Groups','Number']

In [150]:
df

                      A         B
Groups Number
G1     1       0.392489  0.221491
       2      -0.855196  1.541990
       3       0.666319 -0.538235
G2     1      -0.568581  1.407338
       2       0.641806 -0.905100
       3      -0.391157  1.028293

In [154]:
df.loc['G2'].loc[2]['A']

0.6418055114450044

In [155]:
df.xs('G1')

               A         B
Number
1       0.392489  0.221491
2      -0.855196  1.541990
3       0.666319 -0.538235

In [156]:
df.xs(1,level='Number')

               A         B
Groups
G1      0.392489  0.221491
G2     -0.568581  1.407338

In [160]:
d = {'A':[1,2,1],'B':[5,np.nan,2],'C':[1,2,3]}

In [161]:
df = pd.DataFrame(d)

In [162]:
df

   A    B  C
0  1  5.0  1
1  2  NaN  2
2  1  2.0  3

In [166]:
#axis = 1 for column
df.dropna()

   A    B  C
0  1  5.0  1
2  1  2.0  3

In [168]:
df.dropna(thresh =2 )

   A    B  C
0  1  5.0  1
1  2  NaN  2
2  1  2.0  3

In [169]:
df

   A    B  C
0  1  5.0  1
1  2  NaN  2
2  1  2.0  3

In [170]:
df.fillna(value = 'FILL Value')

   A           B  C
0  1         5.0  1
1  2  FILL Value  2
2  1         2.0  3

In [172]:
df['A'].fillna(value= df['A'].mean())

0    1
1    2
2    1
Name: A, dtype: int64

In [173]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'Person':['Sam','Charlie','SiddhantC','Vanessa','Carl','Sarah'],'Sales':[200,120,121,340,340,350]}

In [174]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'SiddhantC', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 121, 340, 340, 350]}

In [175]:
df = pd.DataFrame(data)

In [176]:
df

  Company     Person  Sales
0    GOOG        Sam    200
1    GOOG    Charlie    120
2    MSFT  SiddhantC    121
3    MSFT    Vanessa    340
4      FB       Carl    340
5      FB      Sarah    350

In [185]:
comp = df.groupby('Company')

In [191]:
comp.mean(numeric_only=True)

         Sales
Company
FB       345.0
GOOG     160.0
MSFT     230.5

In [192]:
comp.sum(numeric_only=True)

         Sales
Company
FB         690
GOOG       320
MSFT       461

In [195]:
comp.std(numeric_only=True)

              Sales
Company
FB         7.071068
GOOG      56.568542
MSFT     154.856385

In [199]:
comp.sum(numeric_only=True).loc['FB']

Sales    690
Name: FB, dtype: int64

In [200]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [201]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [208]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  345.0    7.071068  340.0  342.50  345.0  347.50  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  230.5  154.856385  121.0  175.75  230.5  285.25  340.0

In [212]:
df1 = pd.DataFrame({'A':['A1','A2','A3','A4'],'B':['B1','B2','B3','B4'],'C':['C1','C2','C3','C4'],'D':['D1','D2','D3','D4']},index=[1,2,3,4])

In [213]:
df1

    A   B   C   D
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4

In [214]:
df2 = pd.DataFrame({'A':['A5','A6','A7','A8'],'B':['B5','B6','B7','B8'],'C':['C5','C6','C7','C8'],'D':['D5','D6','D7','D8']},index=[5,6,7,8])

In [216]:
df2

    A   B   C   D
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
8  A8  B8  C8  D8

In [217]:
df3 = pd.DataFrame({'A':['A9','A10','A11','A12'],'B':['B9','B10','B11','B12'],'C':['C9','C10','C11','C12'],'D':['D9','D10','D11','D12']},index=[9,10,11,12])

In [218]:
df3

      A    B    C    D
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11
12  A12  B12  C12  D12

In [219]:
pd.concat([df1,df2,df3])

      A    B    C    D
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11
12  A12  B12  C12  D12

In [220]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4    A4   B4   C4   D4  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN   A8   B8   C8   D8  NaN  NaN  NaN  NaN
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11
12  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A12  B12  C12  D12

In [221]:
left = pd.DataFrame({'Key':['K1','K2','K3','K4'],'A':['A1','A2','A3','A4'],'B':['B1','B2','B3','B4']})

In [222]:
left

  Key   A   B
0  K1  A1  B1
1  K2  A2  B2
2  K3  A3  B3
3  K4  A4  B4

In [231]:
right = pd.DataFrame({'Key':['K1','K2','K3','K4'],'C':['C1','C2','C3','C4'],'D':['D1','D2','D3','D4']})

In [232]:
right

  Key   C   D
0  K1  C1  D1
1  K2  C2  D2
2  K3  C3  D3
3  K4  C4  D4

In [236]:
pd.merge(left,right,how='inner',on='Key')

  Key   A   B   C   D
0  K1  A1  B1  C1  D1
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3
3  K4  A4  B4  C4  D4

In [240]:
df1 = pd.DataFrame({'Key1':['K1','K2','K3','K1'],'Key2':['K1','K2','K1','K2'],'A':['A1','A2','A3','A4'],'B':['B1','B2','B3','B4']})

In [241]:
df1

  Key1 Key2   A   B
0   K1   K1  A1  B1
1   K2   K2  A2  B2
2   K3   K1  A3  B3
3   K1   K2  A4  B4

In [247]:
df2 = pd.DataFrame({'Key1':['K1','K2','K3','K2'],'Key2':['K1','K2','K1','K1'],'C':['C1','C2','C3','C4'],'D':['D1','D2','D3','D4']})

In [248]:
df2

  Key1 Key2   C   D
0   K1   K1  C1  D1
1   K2   K2  C2  D2
2   K3   K1  C3  D3
3   K2   K1  C4  D4

In [249]:
pd.merge(df1,df2,on=['Key1','Key2'])

  Key1 Key2   A   B   C   D
0   K1   K1  A1  B1  C1  D1
1   K2   K2  A2  B2  C2  D2
2   K3   K1  A3  B3  C3  D3

In [252]:
pd.merge(df1,df2,how='outer',on=['Key1','Key2'])

  Key1 Key2    A    B    C    D
0   K1   K1   A1   B1   C1   D1
1   K1   K2   A4   B4  NaN  NaN
2   K2   K1  NaN  NaN   C4   D4
3   K2   K2   A2   B2   C2   D2
4   K3   K1   A3   B3   C3   D3

In [257]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [259]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [260]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [263]:
len(df['col2'].unique())

3

In [264]:
df['col2'].nunique()

3

In [265]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [267]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [268]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [269]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [270]:
df['col1'].sum()

10

In [271]:
def times2(x):
    return x*2

In [273]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [278]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [281]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [282]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [283]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [284]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [286]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [287]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [288]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [289]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [290]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [292]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [294]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [295]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [299]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [300]:
df.to_csv('My_output',index=False)

In [302]:
pd.read_csv('My_output')

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1